[
  {
    "title": "Austin Yoga Nidra and Sound Meditation Meetup Group",
    "Total Members": 28,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Mon, Apr 26, 2021",
    "Days Since Most Recent Past Event": 1,
    "Days Until Soonest Upcoming Event": 5,
    "Soonest Upcoming Event": "Mon, May 3, 2021",
    "description": "Welcome all! I'm a certified Yoga Nidra instructor, Master Reiki practitioner and Sound Meditation instructor. Join me in person (masked, socially distanced) for weekly Yoga Nidra sessions where I integrate sound healing aspects (crystal bowls, koshi bells).Tune up your central nervous system, take this time to deeply relax your mind and body and leave in a calmer state of mind!"
  },
  {
    "title": "Austin's Music Meditation and Sound Therapy Group",
    "Total Members": 1,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Wed, Apr 21, 2021",
    "Days Since Most Recent Past Event": 6,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "Who should join: Anyone interested in meditation, mental self-mastery, emotional self-mastery, reducing stress and anxiety, altered states of consciousness, self-healing, and the science behind sound.Why you should join: Members will learn how sound is a powerful tool for meditation and self-transformation. It is sound that makes this type of meditation unique. During a sound meditation, the listener may experience a shift in awareness, increased alertness, an ease in mental activity and reduced discursive thinking patterns. Therapeutic sound is a unique stimulus that synchronizes activity in the brain to the frequencies and rhythmic patterns being heard.What members can expect in the groups: To experience live sound meditation with Harp, Tibetan Singing Bowls, and/or other instruments. To develop knowledge about the therapeutic elements of music and sound. To gain skill in using sound for personal development and as a powerful tool in self healing and self mastery. To build community around meditating..."
  },
  {
    "title": "ACES - Austin Crew of Everything Social",
    "Total Members": 784,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Not Recent",
    "Days Since Most Recent Past Event": "Not Recent",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "Austin Crew of Everything Social (A.C.E.S.) was formed to bring people in the Austin area together, play sports, attend events. We will have organized teams to bring a fun but also competitive atmosphere. Members can come up with Leagues in specific sports, fun events, and entertaining meetups.There are so many exciting, interesting, and weird activities to do around this city and this group will provide a diverse range of entertainment with friends and new people. We have a lot of Clubs ideas and we aren't limiting to any specific event.We will organize games and teams of volleyball, soccer, basketball, paintball, karaoke, stand-up paddle-boarding, kayaking, biking, hiking, running, bowling, Classic Arcade and Pinball, racquetball, tennis, dinner events, happy hours, parties, dances, etc. You Dream it and this can be your home to an endless list of activities. You'll make new friends of all ages, build lasting friendship, stay in touch with..."
  },
  {
    "title": "Meditation + Sound North",
    "Total Members": 215,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Not Recent",
    "Days Since Most Recent Past Event": "Not Recent",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "Everything in life is vibration--Albert EinsteinWelcome to Meditation Sound North...a place to raise your vibrations through meditation and sound therapy practices.Meditation+Sound North offers mindfulness-based meditation classes for those who wish to cultivate a new meditation practice or raise the vibes of your existing practice.Meditation+Sound North is also your place for the relaxing, restorative and rejuvenating sounds and vibrations of the Himalayan healing bowls and crystal bowls.Here, you will find a full schedule of meditation classes, meditation with sound classes, sound bath immersion-meditations and meditation retreats.Peace&Joy !"
  }
]
