[
  {
    "title": "Singles in MCWW +45 Meetup Group",
    "Total Members": 149,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Sat, Jan 18, 2020",
    "Days Since Most Recent Past Event": 465,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "        This is a social group for singles over 45 years old that live in Magnolia, Conroe, Waller & The Woodlands. Dinners, lunches, happy hours, dancing, live music, concerts, hiking, and more fun activities will be planned by members. No prejudice against the under 45, but this is where my lifestyle and age would prefer my group to be. Hoping that we can find friendships and fellowship through common interests in our area. Would love to have Event Organizers to help fill our monthly calendar! So if you are going somewhere, just ask me to set up an event and have old & new friends join you. You can become an Event Organizer and set up your own events too."
  },
  {
    "title": "Texas Christian Music and Performing Arts Group",
    "Total Members": 1,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": "Not Listed",
    "Most Recent Past Event": "Not Listed",
    "Days Since Most Recent Past Event": "Not Available",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "        Singers, Musicians, ()guitarists, pianists, etc.) technical savvy recording, creative types, song writers, actors and dancers. I'd like to form a group that could perform and share beautiful Christian music, worship dance, and bring the Bible to life at community churches and events. I'd also like to offer a social group where we meet, share ideas, learn from each other and spread the word of God."
  },
  {
    "title": "BCS Young Professionals",
    "Total Members": 100,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Mon, Apr 26, 2021",
    "Days Since Most Recent Past Event": 1,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Wed, Apr 28, 2021",
    "description": "        The BCS Young Professionals is a group of fun-loving individuals who want to get out, meet others and have an excellent time. It is the prefect group for people in the BCS area who want to get out and meet new people. We have an eclectic mix of people in their 20's, 30's, and 40's who come from a wide range of fields and have come to the BCS area from all over the world.Whether you are new to town or have been here for a while, if you are looking for a social group the BCS Young Professionals may be the group for you! We have meetups for activities ranging from dinner & drinks, dancing, cookouts, running, playing games, road trips and simply enjoying conversation with each other over coffee.We look forward to meeting you at one of our meetups in the near future!"
  }
]
