[
  {
    "title": "SWING DANCING/Lindy Hop around New Braunfels & San Marcos TX",
    "Total Members": 890,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Wed, Apr 21, 2021",
    "Days Since Most Recent Past Event": 6,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Tue, Apr 27, 2021",
    "description": "        We are trying to build Real Community in the Central Texas New Braunfels and San Marcos area by bringing quality and fun Swing Dance events, instruction, club nights and Festivals. A place for people to meet and bring the best out of them by creating a supportive, exciting, and fun environment with great music that is accessible to all. From East Coast, Charleston, Lindy Hop, Balboa and Shag, everybody has a possibility to get exposed and comfortable with the Dances and how to lead and follow the moves. Find places to dance in New Braunfels and San Marcos TX surroundings. YEAH MAN the \"Home of Happy Feet\""
  },
  {
    "title": "Austin Country Dance and Social Events",
    "Total Members": 857,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Mon, Apr 26, 2021",
    "Days Since Most Recent Past Event": 1,
    "Days Until Soonest Upcoming Event": 4,
    "Soonest Upcoming Event": "Sun, May 2, 2021",
    "description": "        We are a free membership Meetup so you can Join us for Free and you will receive our free dance parties plus Free dance Lessons as your welcome bonus for being the member of this Meetup group to meet, socialize and get to know all other meetup members who are regularly participating in our on going dance parties and our group dance classes in Country Western Two Step, Country One Step, Texas Two Step, Country Waltz, Triple Two step, Country Polka, Country swing, Country Cha-Cha, Jitterbug and different style of Country line dancing.As a member of this meetup group yo can also receive free try out lessons in other styles of dances that we offer such as Salsa, Bachata, Kizomba,Cha-cha, Swing, and Tango dance classes that we are offering at the Clubs, studio and at our other locations and venues in Austin.As a member of this Meetup group, you will..."
  },
  {
    "title": "Mavericks Dance Hall (Buda) Line Dance Lessons!!",
    "Total Members": 290,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Wed, Apr 21, 2021",
    "Days Since Most Recent Past Event": 6,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Wed, Apr 28, 2021",
    "description": "        All Ages, ALL levels line dance instruction from 7:30 to about 8:30 every Saturday night at Mavericks Dance Hall off Grand Avenue Parkway!"
  }
]
