[
  {
    "title": "Austin Startup: Idea to IPO",
    "url": "https://www.meetup.com/Austin-Idea-to-IPO/",
    "Total Members": 915,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Thu, Apr 29, 2021",
    "Days Since Most Recent Past Event": 2,
    "Days Until Soonest Upcoming Event": 1,
    "Soonest Upcoming Event": "Mon, May 3, 2021",
    "description": "Entrepreneurship permeates the culture of Silicon Valley - the innovation capital of the world.The advent of the Digital Age has democratized innovation and entrepreneurship.Never before has it been more possible for anyone from anywhere, with a great idea and a burning desire to succeed, to make it big, and in the process, change the world in a relatively short period of time.HP, Intel, Apple, Microsoft, Cisco, Oracle, Yahoo, eBay, Amazon, Google, Facebook and many, many, many other iconic companies all started with just an idea. Taking a startup from idea to IPO has taken on mythical proportions in Silicon Valley and beyond. Many dream the dream, with hopes of launching the \"next big thing\".We are a community of entrepreneurs, technologists, engineers, venture capitalists, angel investors, educators, financial professionals, corporate executives, attorneys, academics, bloggers, writers, content creators, and social activists."
  },
  {
    "title": "Political Discussion Meetup-Austin",
    "url": "https://www.meetup.com/Politics-Discussion-Meetup/",
    "Total Members": 651,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Wed, Apr 28, 2021",
    "Days Since Most Recent Past Event": 3,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "Are you one of those people who loves watching politics and the news and can't seem to find a group of people that are just that into it? Well this meet up is it.Our intention for this meet up is to focus on current events in the news and allow for conservative, independent and liberal view points on the issue.So here is the setup. We will try to meet twice a month to discuss a topic. A meeting on current events and than another that goes into more detail on a topic. That last one is in the format of a debate or discussion. Most of the topics will cover national and global politics. I will try to make the topic or question as non-partisan as I possible, giving the pros and cons on certain ideas proposed. I want to set up about 5 minutes giving the frame of the..."
  },
  {
    "title": "Platform Engineers (ATX) Online Meetup",
    "url": "https://www.meetup.com/platform-engineers-atx-online/",
    "Total Members": 541,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Tue, Apr 27, 2021",
    "Days Since Most Recent Past Event": 4,
    "Days Until Soonest Upcoming Event": 4,
    "Soonest Upcoming Event": "Thu, May 6, 2021",
    "description": "This is a group for engineers to learn and discuss all things internal tooling, platform teams and internal developer platforms. The goal of this community is to democratize access to Internal Developer Platforms and allow any company to build a world class platform team and internal tooling setup.We strive for empowering any dev team with the best possible setup to ship badass software. You should join if you are working or are looking to work as:-Platform Engineer-SRE-Infrastructure Engineer-DevOps-Cloud EngineerWe are hosting this group in collaboration with the Open Source project https://internaldeveloperplatform.org/ ."
  },
  {
    "title": "Austin Liberty Coalition",
    "url": "https://www.meetup.com/Austin-Liberty-Coalition/",
    "Total Members": 918,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Mon, Apr 26, 2021",
    "Days Since Most Recent Past Event": 5,
    "Days Until Soonest Upcoming Event": 2,
    "Soonest Upcoming Event": "Tue, May 4, 2021",
    "description": "Free people, competing markets and lawful governmentThe Austin Liberty Coalition (https://www.meetup.com/Austin-Liberty-Coalition) group is a Political Action Meetup Calendar and Message Board shared between local Citizen Activist Organizations that place a high value on protecting civil liberties (http://en.wikipedia.org/wiki/Civil_liberties). Message Board announcements are restricted to originate only from designated organization contacts. This is the activist Coalition to join if you organize any liberty issue task force and want to reach the entire Austin Liberty Coalition activist community with your announcements or event invitations. Likewise if you are a concerned citizen and want to receive liberty news and announcements from the liberty community this is the group to join.The Austin Liberty Coalition (https://www.meetup.com/Austin-Liberty-Coalition) Meetup Group in Texas is a loose-knit, coalition of grassroots organizations who originally united around the 2007-2008 Presidential campaign principles of Congressman Ron Paul - the quintessential anti-Washington candidate of our time. The peaceful r3VOLution principles (http://en.wikipedia.org/wiki/Ron_Paul_presidential_campaign,_2008#Grassroots_campaign_efforts) drew together diverse..."
  },
  {
    "title": "Kubernetes Austin",
    "url": "https://www.meetup.com/Kubernetes-Austin/",
    "Total Members": 1151,
    "Upcoming Events Displayed": 1,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Tue, Mar 16, 2021",
    "Days Since Most Recent Past Event": 46,
    "Days Until Soonest Upcoming Event": 45,
    "Soonest Upcoming Event": "Wed, Jun 16, 2021",
    "description": "Kubernetes Austin is the official Kubernetes meetup for Austin, Texas. We host talks from anyone doing cool things with Kubernetes, including companies using K8S in production or vendors who are pushing the boundaries of what K8S can do. Presentations are demo focused and not sales pitches.This group follows these three central ideas:• We believe in open sponsorships, so anyone can cover the cost of food, space, and travel for speakers. To not price out smaller vendors, sponsorship prices are not set beyond the cost. Organizations donating speakers, food/drinks, or space will automatically count as sponsors for the event.• We believe in democratized organization, so anyone in the Kubernetes community that wants to help organize can be a part of process.• We believe that all Kubernetes Meetups should be democratic and those that do not allow others to take part in organizing and sponsoring are not in the spirit of open..."
  },
  {
    "title": "Techies Turning Texas Blue",
    "url": "https://www.meetup.com/Techies-Turning-Texas-Blue/",
    "Total Members": 115,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Tue, Jan 21, 2020",
    "Days Since Most Recent Past Event": 466,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "There is a war of information being waged and democrats are behind. The battleground is digital.Let's get together a group of tech professionals (researchers, UX designers, UI designers, social media marketers and engineers) to help spread information about evidence backed progressive policies and why people should get out and vote for them.How do we change minds? How do we initiate action? What are the greatest problems to solve and what is their priority?We will campaign for equality, the environment and future generations.If you want to work on real products that promote actual change, join us!"
  },
  {
    "title": "Sudbury School Founding Group",
    "url": "https://www.meetup.com/Sudbury-School-Founding-Group/",
    "Total Members": 14,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": "Not Listed",
    "Most Recent Past Event": "Not Listed",
    "Days Since Most Recent Past Event": "Not Available",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "This is a group for founding a Sudbury Valley School in the Northeast Austin Area. The Sudbury Valley School model is an innovative educational model that takes children seriously."
  },
  {
    "title": "Austin Yang Gang!",
    "url": "https://www.meetup.com/Austin-YangGang/",
    "Total Members": 63,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Not Recent",
    "Days Since Most Recent Past Event": "Not Recent",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "\"The opposite of Donald Trump is an Asian man who likes MATH (Make America Think Harder)!\"Dedicated supporters and volunteers for Andree Yang 2020."
  }
]
