[
  {
    "title": "LPGA Amateur Golf Association - Austin TX",
    "url": "https://www.meetup.com/LPGAAmateurGolfAssociationAustin/",
    "Total Members": 532,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sat, May 1, 2021",
    "Days Since Most Recent Past Event": 2,
    "Days Until Soonest Upcoming Event": "Today!",
    "Soonest Upcoming Event": "Tue, May 4, 2021",
    "description": "Looking for members of LPGA Amateur Golf Association, Austin TX Chapter to play golf with? Great opportunity to find others as well as to invite other women to have a look at our group. Got some golf passes and need some players? Post it here."
  },
  {
    "title": "9 at 5 Networking Golf Scramble",
    "url": "https://www.meetup.com/9-at-5-networking-golf-scramble/",
    "Total Members": 27,
    "Upcoming Events Displayed": 1,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Mon, Apr 12, 2021",
    "Days Since Most Recent Past Event": 21,
    "Days Until Soonest Upcoming Event": 6,
    "Soonest Upcoming Event": "Mon, May 10, 2021",
    "description": "Join our \"9 at 5\" business networking golf scramble. This 9-hole scramble is designed for fun while networking with other business professionals. Grab a drink afterwards for introductions and prizes. Limited spots available. This will be a recurring event for the next four months. Play once or play them all. Teams will be arranged for maximum networking opportunities. Cost is $29.Where: Forest Creek Golf Club, 99 Twin Ridge Parkway, Round Rock, TX 78664When: Mondays at 5PM on March 22, April 12, May 10, and June 14."
  },
  {
    "title": "Afternoon Golf",
    "url": "https://www.meetup.com/afternoon-golf/",
    "Total Members": 27,
    "Upcoming Events Displayed": 1,
    "Past Events Displayed": "Not Listed",
    "Most Recent Past Event": "Not Listed",
    "Days Since Most Recent Past Event": "Not Available",
    "Days Until Soonest Upcoming Event": 4,
    "Soonest Upcoming Event": "Sat, May 8, 2021",
    "description": "\"If you play golf, you're my friend.\" - Harvey PenickDo you like golf, but maybe not the 6:45 AM weekend tee time? Are you looking for a friendly, chill group to hang out with? Do you love the outdoors, and aren't afraid of a little Texas sunshine? Well, this group may be for you!Even though we'll be outdoors, we expect reasonable social distancing while we're still in a pandemic. We also expect full compliance with the recommended mask wearing requirements of our host course.Join us for an upcoming tee time.Let's hit the links!"
  },
  {
    "title": "American Singles Golf Association AUSTIN CHAPTER",
    "url": "https://www.meetup.com/asgaaustin/",
    "Total Members": 427,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Not Recent",
    "Days Since Most Recent Past Event": "Not Recent",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "CHECK BACK OFTEN.....we are Re-Organizing Austin Chapter of American Singles Golf Association. Many potential golfers signed up, but need some leadership, as past leaders moved away. American Singles Golf Association (www.singlesgolf.com) is a group of chapters throughout United States/Canada, composed of single people. Meet at a course, play golf, stay for drinks/dinner. Chapter occasional meetings/socials. Joining ASGA allows local CHAPTER members to attend great events around the USA, hosted by one or multiple Chapters. Events from coast to coast. National office plans great trips annually to many places. To name a few: Hawaii, Pinehurst, Scotland, and Orlando. All National trips invite dues current ASGA members to participate. The trips and members include ALL ages. The near 50+ group more represented. Dues to join ASGA go half to local chapter.Meeting through golf is a good way to begin any relationship, business, personal, friends. Most importantly, we're all about having FUN! It..."
  },
  {
    "title": "Better Health?  Better Wealth?  Better GOLF!!!",
    "url": "https://www.meetup.com/Better-Health-Better-Wealth-Better-GOLF/",
    "Total Members": 31,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 2,
    "Most Recent Past Event": "Not Recent",
    "Days Since Most Recent Past Event": "Not Recent",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "This Meetup is the perfect platform to better your quality of life through golf. Golf is a magical journey with something to offer everyone. Use it to advance your social circle, your professional network, or your family's unity. Intoxicate your senses with the scent of sweet dew on the grass at dawn, or absorb the breathtaking views of sunset as shadows are cast across the fairways and the everchanging sky is unparalleled until it morphs again a moment later. Improve your health with the exercise golf demands, sharpen your mind with the challenges golf presents, cherish the moments of greatness every swing provides the opportunity for. Golf can be the vehicle of competition for the competitive spirit or the place of solace to escape the rat race if only for awhile. The golf ball knows not your height, your age, or your athleticism. There is a unique swing in everyone,..."
  }
]
