[
  {
    "title": "History Matters: Book Club With Beer",
    "url": "https://www.meetup.com/history-matters/",
    "Total Members": 115,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sat, May 1, 2021",
    "Days Since Most Recent Past Event": "Today!",
    "Days Until Soonest Upcoming Event": 6,
    "Soonest Upcoming Event": "Sat, May 8, 2021",
    "description": "Normally we meet at the Draught house English pub and imbibe some beer while discussing hsitory.Titles range from more rigorous and scholarly works to lighter, more journalistic writing. Genres tend to include foreign policy, history, culture, science, politics, and area studies (e.g. The Middle East, Europe, South Asia, etc.) See our \"Past Reads\" page for titles."
  },
  {
    "title": "It's Boomertime!",
    "url": "https://www.meetup.com/boomertime/",
    "Total Members": 5544,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sat, May 1, 2021",
    "Days Since Most Recent Past Event": "Today!",
    "Days Until Soonest Upcoming Event": "Today!",
    "Soonest Upcoming Event": "Sat, May 1, 2021",
    "description": "It’s Boomertime is an organization dedicated to adding new friends, adventure, excitement, and fun to our every day lives. It’s Boomertime is one of the most active Meetup groups in Austin, with currently over 100 events every month giving members the opportunity daily to choose to enhance their lives in a variety of ways. We are fortunate to have the assistance of numerous \"Event Hosts\" who regularly post a wide variety of events: hiking, happy hours, dining, sports events, dancing, live music, arts, daytrips, campouts, yoga, gallery tours, movies, theater, game nights, festivals, holiday parties and a whole lot more. You are sure to find some events and some great friendly people to enjoy those events with. As a member you are invited to pursue becoming an \"Event Host\" and/or \"Event Organizer\" and share your ideas of fun and happiness with others. Hosting an event is one of the best..."
  },
  {
    "title": "Austin Society for Creative Anachronism",
    "url": "https://www.meetup.com/Austin-Society-for-Creative-Anachronism/",
    "Total Members": 131,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Tue, Apr 27, 2021",
    "Days Since Most Recent Past Event": 4,
    "Days Until Soonest Upcoming Event": 2,
    "Soonest Upcoming Event": "Tue, May 4, 2021",
    "description": "Anyone in the Austin and surrounding area who is interested in inter-active, hands on research and recreating the medieval world. We have activities for everyone!The SCA is a practical history society, recreating the arts and skills of pre-17th century Europe. While dressed in clothing of the Middle Ages and Renaissance, you can experience tournaments, royal courts, feasts, and dancing. You also have the opportunity to learn and practice ancient arts and skills — calligraphy, cooking, armoring, metalworking, carpentry, and needlework (to name just a few) — within an all-ages social group. The SCA is a great place to make friends and learn transferable skills.\"What is the SCA? Not only is it some of the most awesome fun that you'll ever have, but the people you meet here will become the best family that you'll ever have. \" -- The Honorable Lady Jerusha Kilgore"
  },
  {
    "title": "Nonfiction Book Club",
    "url": "https://www.meetup.com/Nonfiction-Book-Club-Austin/",
    "Total Members": 74,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Wed, Apr 7, 2021",
    "Days Since Most Recent Past Event": 24,
    "Days Until Soonest Upcoming Event": 3,
    "Soonest Upcoming Event": "Wed, May 5, 2021",
    "description": "We meet to discuss nonfiction books in a wide variety of genres--science, history, memoir, politics, and beyond! Members can suggest books at any time. We will vote monthly on three options and the top choice will become the next book for the following month.Dues are $6 per year to cover the costs of organizing through Meetup.Books we've previously read:March 2016 - \"Black Flags: The Rise of ISIS\"February 2016 - \"The Warmth of Other Suns: The Epic Story of America's Great Migration\"January 2016 - \"Far from the Tree: Parents, Children, and the Search for Identity\"November 2015 - \"Brain on Fire: My Month of Madness\"October 2015 - \"The Evolution of God\"September 2015 - \"Being Mortal: Medicine and What Matters in the End\"August 2015 - \"Through the Language Glass: Why the World Looks Different in Other Languages\"July 2015 - \"Spam Nation: The Inside Story of Organized Cybercrime\"June 2015 - \"The Underground Girls of..."
  },
  {
    "title": "The Lecture Bar Austin",
    "url": "https://www.meetup.com/The-Lecture-Bar-Austin/",
    "Total Members": 115,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Wed, Feb 24, 2021",
    "Days Since Most Recent Past Event": 66,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "Join me for online lectures in history, science, the occult, history, the arts, literature, famous personalities, film, and more, and hear from professors, authors, artists, museum curators and other brilliant and diverse experts. You’ll engage in discussion and online conversation with others in your city, as well curious minds across the country! Just like your favorite bar where you can be yourself and meet friends, pull up a stool and find your people at The Lecture Bar."
  },
  {
    "title": "Cedar Park Nonfiction Book Club",
    "url": "https://www.meetup.com/Cedar-Park-Nonfiction-Book-Club/",
    "Total Members": 33,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Wed, Jul 29, 2020",
    "Days Since Most Recent Past Event": 276,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "(Online for now until CORVID-19 risk is reduced.)Do you find yourself reading more nonfiction than fiction today and want to share your thoughts? Do you need the inspiration to pick up a book for conversational fodder or to expand your viewpoints and understanding of others?We'll have 4-6 weeks to finish each book. Meetings will last about two hours. Nonfiction books will cover topics including:• American and other cultures• politics• history• true crime• sociology• business/finance• social justice• science• memoirsThe last few books I've read include Ibram Kendi's How to Be Antiracist; Killers of the Flower Moon; The Byline Bible; Trevor Noah's autobio; and Gorge. On my wishlist now are How the Irish Became White; A Book of Bees: And How to Keep Them; Start Finishing: How to Go from Idea to Done; and How Charts Lie: Getting Smarter about Visual Information. Find me on Goodreads (https://www.goodreads.com/jrosehale).I am liberal-aligned and my book..."
  },
  {
    "title": "Permanent.org Community",
    "url": "https://www.meetup.com/Permanent-org-Developer-Community/",
    "Total Members": 45,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Not Recent",
    "Days Since Most Recent Past Event": "Not Recent",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "This group is for anyone who wants to participate in a groundbreaking project with real social and cultural impact. We have many projects where people can contribute and add real world experience to their resumes.We welcome everyone to join regardless of your skills and expertise. We can always use volunteers in a variety of ways. We especially need designers and front end developers to help our non-profit partners build new and exciting web pages to show the great work they are doing.As a nonprofit historical trust, the Permanent Legacy Foundation exists to preserve the digital legacy of all people, for all time. We make it possible for anyone to make their personal, family, or community history accessible to future generations."
  },
  {
    "title": "Austin American History Meetup Group",
    "url": "https://www.meetup.com/Austin-American-History-Meetup-Group/",
    "Total Members": 12,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": "Not Listed",
    "Most Recent Past Event": "Not Listed",
    "Days Since Most Recent Past Event": "Not Available",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "We will walk and show people some of the historic sites."
  }
]
