[
  {
    "title": "San Marcos Meditation Meetup",
    "url": "https://www.meetup.com/San-Marcos-Meditation-Meetup/",
    "Total Members": 659,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Thu, Apr 22, 2021",
    "Days Since Most Recent Past Event": 5,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Wed, Apr 28, 2021",
    "description": "Interested in learning how to meditate? Or maybe you have a practice and would like to be with other people on the path for support?Meditation is the practice of transforming the mind by using techniques that cultivate clarity and concentration with a gentle, loving and curious approach to seeing the true nature of things. A meditation practice can helps us experience our thoughts, sensations and emotions without identifying with them or believing the \"stories\" in our heads. We can wake up to our conditioned and habitual thought patterns or habits that cause suffering and become aligned with our heart and inner. Having a \"sangha\" or spiritual community can make all the difference in the world in cultivating a consistent meditation practice.We usually have ongoing meditation gatherings and various other wellness classes each week, though always refer to posted meetups as schedules change.Everyone is welcome regardless of what you believe in...."
  },
  {
    "title": "Austin's Music Meditation and Sound Therapy Group",
    "url": "https://www.meetup.com/Austins-Music-Meditation-and-Sound-Healing-Group/",
    "Total Members": 1,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Wed, Apr 21, 2021",
    "Days Since Most Recent Past Event": 6,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "Who should join: Anyone interested in meditation, mental self-mastery, emotional self-mastery, reducing stress and anxiety, altered states of consciousness, self-healing, and the science behind sound.Why you should join: Members will learn how sound is a powerful tool for meditation and self-transformation. It is sound that makes this type of meditation unique. During a sound meditation, the listener may experience a shift in awareness, increased alertness, an ease in mental activity and reduced discursive thinking patterns. Therapeutic sound is a unique stimulus that synchronizes activity in the brain to the frequencies and rhythmic patterns being heard.What members can expect in the groups: To experience live sound meditation with Harp, Tibetan Singing Bowls, and/or other instruments. To develop knowledge about the therapeutic elements of music and sound. To gain skill in using sound for personal development and as a powerful tool in self healing and self mastery. To build community around meditating..."
  },
  {
    "title": "Inner Engineering Austin (Isha Yoga & Meditation Classes)",
    "url": "https://www.meetup.com/Isha-Yoga-Austin-Free-Meditation-Classes/",
    "Total Members": 2,
    "Upcoming Events Displayed": 1,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Mon, Apr 12, 2021",
    "Days Since Most Recent Past Event": 15,
    "Days Until Soonest Upcoming Event": 1,
    "Soonest Upcoming Event": "Thu, Apr 29, 2021",
    "description": "\"If life were to come with a manual, this in my opinion would be it! If we all applied the Inner Engineering technology, our world would instantly transform to exist from a foundation of peace, joy, and compassion for all beings.\" -Evita OchelFor all of the strides we have made in science and technology with standards of living unimaginable a century ago, most human beings still remain in search of wholeness and purpose in their lives. Inner Engineering (http://www.ishausa.org/programs/inner-engineering/?webSyncID=6366b7b5-2e57-b99d-a0d9-8144b41a2963&sessionGUID=978454c1-093a-d3e1-8b9c-608859c3457e) is scientifically-structured to offer powerful processes from the ancient tradition of yoga to transcend the limitations of who you are and bring you to higher levels of consciousness. Inner Engineering was designed by Sadhguru, a yogi, visionary, and one the foremost authorities on yoga as a powerful tool to create your life the way you want it.https://www.youtube.com/watch?v=hUeyqLTsGJsSadhguru & Deepak Chopra— Creating Inner Peace, Joy and Fulfillment in a Hectic Modern World\"The..."
  },
  {
    "title": "Meditation for Spiritual Awareness Austin",
    "url": "https://www.meetup.com/SOS-Meditation-Meetup-Group-Austin/",
    "Total Members": 266,
    "Upcoming Events Displayed": 2,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Tue, Apr 27, 2021",
    "Days Since Most Recent Past Event": "Not Available",
    "Days Until Soonest Upcoming Event": 5,
    "Soonest Upcoming Event": "Mon, May 3, 2021",
    "description": "We are a worldwide organization dedicated to transforming lives through meditation. At our events you will learn about the many benefits of meditation and how meditation can improve your life. You will also receive instructions on how to meditate and have an opportunity to practice this simple meditation technique. Anyone who is curious about meditation, wants to connect with a group to meditate together, progress spiritually or is simply curious about us is welcome to attend.The meditation practice taught by Science of Spirituality is unique in its simplicity and effectiveness and is of free of charge."
  },
  {
    "title": "The Austin Yoga Meditation Group",
    "url": "https://www.meetup.com/Yoga-Meditation-Group/",
    "Total Members": 3,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Tue, Apr 27, 2021",
    "Days Since Most Recent Past Event": "Not Available",
    "Days Until Soonest Upcoming Event": 1,
    "Soonest Upcoming Event": "Thu, Apr 29, 2021",
    "description": "Welcome! We have reopened and are offering a few in-person classes and events. We hope to be adding more soon!NOTE: We do not require masks in our classes. We believe it is important to be able to breathe freely while practicing yoga meditation, asana, and relaxation. Classes will be limited in size to allow for distancing as needed. Reservations are required ahead of time to help us manage class size. If you are not comfortable with this, we have audio classes you can practice with (just ask).If you'd like to receive our emails, you can contact us by email or phone/text:info@YogaMeditationGroup.org(512) 774-4964Below is a description of what we do. We hope to meet you soon! Namaste.The Austin Yoga Meditation Group is dedicated to teaching yoga in all its aspects to all ages. The word \"yoga\" means to \"link up\" or \"connect\"; we get the English word \"yoke\" from the word..."
  }
]
