[
  {
    "title": "Austin Mindful Metamorphosis - Create The Life You Want!",
    "url": "https://www.meetup.com/austin-mindful-metamorphosis/",
    "Total Members": 68,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sat, May 1, 2021",
    "Days Since Most Recent Past Event": "Today!",
    "Days Until Soonest Upcoming Event": 3,
    "Soonest Upcoming Event": "Wed, May 5, 2021",
    "description": "The life that you are experiencing is the creation of your own mind.Once you understand that your thought process and belief system have created the life you have, you can then learn how to can change your thinking and beliefs to create the life you want!I share valuable information and exercises that will give you the knowledge and tools you need to obtain real positive change in your life. Some you may already know, but much of it will be brand new to you... directly from the scientific community!Come to my events and you will learn effective methods and techniques to calm your mind and body and have more control over your thoughts and regulate your feelings. This alone is life transforming! Can you imagine? Being able to have that kind control over your mind and body? YES... it is possible. I've done it and I help others do the..."
  },
  {
    "title": "True Potential of the Mind Meetup Group",
    "url": "https://www.meetup.com/true-potential-of-the-mind/",
    "Total Members": 27,
    "Upcoming Events Displayed": 2,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sat, May 1, 2021",
    "Days Since Most Recent Past Event": "Today!",
    "Days Until Soonest Upcoming Event": "Today!",
    "Soonest Upcoming Event": "Sat, May 1, 2021",
    "description": "The purpose of the group is to introduce people to real underlying cause of anxiety, self doubt and negative thoughts. AND even better... how to overcome this!Anyone seeking further understanding of the mind and what the mind is capable of can join.If you are seeking broader understanding of the mind and how to overcome things like past losses, fears and negativity then you may find this right for you.At our events we will learn and go over what this hidden mind is and what are your potentials. We will have at the end of the event a Q&A period with Answers from a highly trained specialist in the subject and suggested reading to understand and conquer the mind!"
  },
  {
    "title": "Austin Mindful Self-Compassion Meetup Group",
    "url": "https://www.meetup.com/Austin-Mindful-Self-Compassion-Meetup-Group/",
    "Total Members": 259,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Wed, Apr 28, 2021",
    "Days Since Most Recent Past Event": 3,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "We host monthly events to offer Mindful Self-Compassion (MSC) practices. A trained MSC teacher will be present at each meeting to guide discussion and facilitate exercises. All are welcome to attend--no prior experience with meditation or self-compassion is necessary."
  },
  {
    "title": "Austin Mindfulness",
    "url": "https://www.meetup.com/austinmindfulness/",
    "Total Members": 3033,
    "Upcoming Events Displayed": 1,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sun, Apr 25, 2021",
    "Days Since Most Recent Past Event": 6,
    "Days Until Soonest Upcoming Event": 7,
    "Soonest Upcoming Event": "Sun, May 9, 2021",
    "description": "We will explore exercises in secular mindfulness. This is intentional present-moment awareness. How can we rest in our senses? How can we gain insight into the very process that propels us from one moment to the next through clear observation? Can we intersect this process in a way that leads to greater contentment, less impulsivity, and less stress?Generally, mindfulness is a practice that develops intentional present moment awareness. It does not require any beliefs. In this practice, we rely on the unifying and grounding aspects of science. We avoid divisions that come from belief-systems, whenever possible.The mindfulness practices we will explore are based on MBSR, a clinically proven method. However, this group is for a typical person who is psychologically stable and healthy. This is not a substitute for mental or physical healthcare. If you have serious physical or mental health issues please see a qualified and licensed practitioner to..."
  },
  {
    "title": "Mindfulness in Nature",
    "url": "https://www.meetup.com/Mindfulness-in-Nature/",
    "Total Members": 846,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Sat, Jan 11, 2020",
    "Days Since Most Recent Past Event": 476,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "“The wilderness holds answers to more questions than we yet know how to ask.” – Nancy Newhall, conservationist and photographer2020 will mark the fourth year of this group, which has evolved into a wonderful, welcoming group of like-hearted people. I hope you'll take a moment to read over the description, and if these words resonate with you, I hope you'll join us sometime this year.This is a free group open to anyone who is interested in practicing mindfulness through a curious and contemplative relationship with nature. Nature can be a wonderful teacher, mirror, and guide which can help us learn about ourselves, connect with each other and the larger web of life, and experience appreciation and gratitude. The beauty, mystery, and wonder of the natural world so easily and effortlessly pulls us into a mindful state of being, which can help to develop or support a mindfulness practice. Through learning..."
  }
]
