[
  {
    "title": "Austin Humanist Community",
    "url": "https://www.meetup.com/Austin-Humanist/",
    "Total Members": 1,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sun, Apr 25, 2021",
    "Days Since Most Recent Past Event": 2,
    "Days Until Soonest Upcoming Event": 4,
    "Soonest Upcoming Event": "Sun, May 2, 2021",
    "description": "Austin Humanist Community provides a caring, safe, and intellectually stimulating environment for humanists. By holding regular meetings, planning social activities, and organizing outreach and volunteer opportunities, we empower our members to grow as individuals, connect with other like-minded, secular people, and enrich the lives of those in need, both inside and outside our community.Every Sunday at 11 am, we meet to enjoy live music, hear presentations by members and outside speakers, and make new friends. Our talks are grounded in reason and celebrate the human experience; our actions stem from the notion that meaning comes from making a difference. And please join us for lunch afterwards at a nearby restaurant!Beyond the Sunday Gathering, our community engages in other activities including local volunteerism, potlucks, game nights, and cultural outings. For more information, please visit us online at http://www.austinhumanist.org/ ."
  },
  {
    "title": "Austin Secular Families",
    "url": "https://www.meetup.com/austin-secular-families/",
    "Total Members": 255,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Sun, Mar 21, 2021",
    "Days Since Most Recent Past Event": 37,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "Welcome to Austin Secular Families!Although we live in Austin, the coolest and most liberal place you can find in Texas, it somehow seems impossible to find other non-religious families. It's very awkward to bring up religion (or lack thereof) to people you've just met, but for me it's a very important aspect of meeting new people. Especially families my kids will see regularly. And that's what this group hopes to achieve: offering a place where families can get together without the preconceived notion that we all attend church on Sunday.We are under the umbrella of the Center for Inquiry, which is a really awesome group of people who do really awesome things - lecture series, discussion groups, book groups, going out for dinner, volunteering, etc. ...most of which don't typically happen at the playground on a Tuesday at 10 am. This is the place for families to meet and let..."
  },
  {
    "title": "Secular Suzies",
    "url": "https://www.meetup.com/Secular-Suzies/",
    "Total Members": 341,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Sat, Feb 8, 2020",
    "Days Since Most Recent Past Event": 444,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "We take our name from Susan B. Anthony. We are a ladies group that meets a couple of times a month to give secular women an opportunity to socialize and discuss matters that are important to them without having to censor themselves regarding their lack of belief in the supernatural and/or lack of religion.This group is open to women including transgender women who are secular, secular humanist, atheist, agnostic, freethinking, non-theist, and non-religious. Secular Suzies is a part of the Center for Inquiry - Austin. If you are looking for additional social activities with secular people, check out the CFI Austin page, and the Austin Secular Families page:http://www.meetup.com/cfiaustin/http://www.meetup.com/austin-secular-families/"
  }
]
