[
  {
    "title": "Austin Single Professionals Meetup Group",
    "url": "https://www.meetup.com/singleandpro/",
    "Total Members": 344,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Fri, Apr 30, 2021",
    "Days Since Most Recent Past Event": 1,
    "Days Until Soonest Upcoming Event": 5,
    "Soonest Upcoming Event": "Fri, May 7, 2021",
    "description": "How do you meet people in Austin? Join this group. If you are single in Austin and you are looking to meet other single people in Austin start here. We schedule events every month that will at the very least help you find more friends."
  },
  {
    "title": "Singles Night Outs Austin",
    "url": "https://www.meetup.com/Singles-Night-Outs-Austin/",
    "Total Members": 676,
    "Upcoming Events Displayed": 3,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Fri, Apr 30, 2021",
    "Days Since Most Recent Past Event": 1,
    "Days Until Soonest Upcoming Event": "Today!",
    "Soonest Upcoming Event": "Sat, May 1, 2021",
    "description": "Join us if you're new in town or just want to expand your social circle.This group is for singles of all ages. We'll have some meetups for 20s & 30s and others for 40s & 50s or 50+ to make it fair to all age groups.The group posts online and in-person (when it's safe or post-Covid) meetups to have a great time and meet new people. Individual meetups will have a specific age range to make it fun and engaging.The activities include online events, speed datings, mixers, happy hour and more. If you have any new event ideas please join the group and send a message to the organizer. We could use some help with organizing fun meetups.Looking forward to chatting with you!"
  },
  {
    "title": "Texas East Indian Origin Divorced,Matured Singles & Widowed",
    "url": "https://www.meetup.com/Desi-Indians-Austin-Divorced-MatureSingles-Widows/",
    "Total Members": 59,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Fri, Apr 30, 2021",
    "Days Since Most Recent Past Event": 1,
    "Days Until Soonest Upcoming Event": "Today!",
    "Soonest Upcoming Event": "Sat, May 1, 2021",
    "description": "This group is for Singles of East Indian Origin (means Indians that come from all over the world not just India) that reside in Austin and surrounding areas in Texas who are Divorced, Mature Singles (45+ yrs means never married due to life circumstances) and Widows. Please note we are NEITHER divorce attorneys NOR professional advisors NOR counselors NOR therapists. If you are currently Separated, please wait till Divorce is finalized before joining this group.Our goal is also to socialize and enjoy with like-minded friends in a similar stage in life. Let us meet to experience the activities and scenic attractions this city and surrounding areas has to offer. At the end of the day, the hope is to form a well-knit community that will support its members and can provide companionship through a safe platform to form new relationships or friendships.Focus groups have been created in Meetup that will..."
  },
  {
    "title": "Singles Volunteering ATX",
    "url": "https://www.meetup.com/singles-volunteering/",
    "Total Members": 371,
    "Upcoming Events Displayed": 3,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Thu, Apr 29, 2021",
    "Days Since Most Recent Past Event": 2,
    "Days Until Soonest Upcoming Event": 6,
    "Soonest Upcoming Event": "Sat, May 8, 2021",
    "description": "Welcome singles sick of the online dating scene and bar scene. Do you enjoy volunteering and giving back to your community? Want to find a date, partner, or friends who share similar interests? Then lets volunteer together! Austin has a ton of great non-profits and volunteer organizations, so check in here for opportunities to give back while getting to know other community- and giving-minded folks like you!"
  },
  {
    "title": "Austin Singles Community",
    "url": "https://www.meetup.com/Austin-Singles-Community/",
    "Total Members": 1528,
    "Upcoming Events Displayed": 3,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sun, Apr 25, 2021",
    "Days Since Most Recent Past Event": 6,
    "Days Until Soonest Upcoming Event": "Today!",
    "Soonest Upcoming Event": "Sun, May 2, 2021",
    "description": "A meetup for singles to explore the best Austin has to offer and what it means to be living in community in Austin, Texas. Popular events include dinners on Sunday evenings, hikes, dancing, movies, live music, football game parties, lake events and day trips.You can find us on Facebook. 'Like' this page to get notice of events, news for singles on your Facebook feed. https://tinyurl.com/austinsinglesCode of ConductBe kind and considerate to all. A real identity is needed. A recognizable picture of your face and/or your real name on your profile is required. Keep communications on the meetup positive, respectful of others, and nonpolitical.The Legal Stuff - Your Assumption of Risk, Release of LiabilityBy participating in an activity with Austin Singles Community, you are acknowledging the risk of injury while participating, and in exchange for the right to participate in the activity, you knowingly and voluntarily waive any and all rights,..."
  },
  {
    "title": "Hiking & Outdoors for Singles",
    "url": "https://www.meetup.com/Hiking-for-Singles/",
    "Total Members": 261,
    "Upcoming Events Displayed": 3,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sun, Apr 25, 2021",
    "Days Since Most Recent Past Event": 6,
    "Days Until Soonest Upcoming Event": 6,
    "Soonest Upcoming Event": "Sat, May 8, 2021",
    "description": "Hi and welcome to the group! This group is dedicated to singles who love to hike, camp, kayak and do things outdoors, specifically those in their late 30s to early 50s.We are pretty laid back and welcome any and all levels. Our events are usually in the evenings and incorporate some sort of social activity so we can get to know each other.We are hoping, through this group, to create a fun and relaxed atmosphere in which we can meet new people and have some cool experiences along the way. We welcome suggestions on cool new hikes or activities so please message us with any ideas!*Due to excessive waitlists for the events, anyone with 3 or more no shows will be removed from the group. Please remember to always change your RSVP to not going and try to give us 24 hours notice so someone else has a chance to..."
  },
  {
    "title": "Active Awesome ATX 20s and 30s Singles Meetup",
    "url": "https://www.meetup.com/active-awesome-atx-20-s-30-s-singles-meetup/",
    "Total Members": 398,
    "Upcoming Events Displayed": 2,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sat, Apr 24, 2021",
    "Days Since Most Recent Past Event": 7,
    "Days Until Soonest Upcoming Event": 6,
    "Soonest Upcoming Event": "Sat, May 8, 2021",
    "description": "Let’s face it, dating apps are the worst. Sadly, being single isn’t a great alternative. Calling all 20s-30s single people! No matter what sexual orientation or gender identity. Let’s hang out in a group once a month to do some fun activities. During every event everyone will be given glow in dark wrist bands so that everyone can easily identify the group. Maybe make some friends, maybe meet someone special, maybe find a new favorite taco? Who knows! The sky is the limit!"
  },
  {
    "title": "Fun Singles 30s & 40s of Austin Texas",
    "url": "https://www.meetup.com/fun-singles-30s-and-40s/",
    "Total Members": 3877,
    "Upcoming Events Displayed": 1,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sat, Mar 13, 2021",
    "Days Since Most Recent Past Event": 49,
    "Days Until Soonest Upcoming Event": 41,
    "Soonest Upcoming Event": "Sat, Jun 12, 2021",
    "description": "We're fun, single and in our 30/40s. We do a wide variety of meetups and activities in Austin. Just being social and meeting some other great people. We are all about being happy and having fun in any activity we take on. This group is meant to be a relaxing, no pressure, and fun way to meet other single folks of a similar age.Member Rules and Requirements:1. Yes - You need to be single in the traditional and legal sense. (No poly, open relationships, etc)2. Yes - We welcome those of all sexual orientations and gender identities. (Y'all means all!)3. Yes - You need to be in your 30s or 40s (actual physical age. sorry, young or old at heart doesn't apply.)4. Yes - You need to be fun! (No debbie downers please :)Please Note: This group is *not* tinder.It is not okay to message users without their permission that..."
  }
]
