[
  {
    "title": "Active Awesome ATX 20s and 30s Singles Meetup",
    "Total Members": 325,
    "Upcoming Events Displayed": 1,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sat, Apr 10, 2021",
    "Soonest Upcoming Event": "Sat, Apr 24",
    "description": "        Let’s face it, dating apps are the worst. Sadly, being single isn’t a great alternative. Calling all 20s-30s single people! No matter what sexual orientation or gender identity. Let’s hang out in a group once a month to do some fun activities. During every event everyone will be given glow in dark wrist bands so that everyone can easily identify the group. Maybe make some friends, maybe meet someone special, maybe find a new favorite taco? Who knows! The sky is the limit!"
  },
  {
    "title": "Singles Night Outs Austin",
    "Total Members": 660,
    "Upcoming Events Displayed": 3,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Fri, Apr 23, 2021",
    "Soonest Upcoming Event": "Sat, Apr 24",
    "description": "        Join us if you're new in town or just want to expand your social circle.This group is for singles of all ages. We'll have some meetups for 20s & 30s and others for 40s & 50s or 50+ to make it fair to all age groups.The group posts online and in-person (when it's safe or post-Covid) meetups to have a great time and meet new people. Individual meetups will have a specific age range to make it fun and engaging.The activities include online events, speed datings, mixers, happy hour and more. If you have any new event ideas please join the group and send a message to the organizer. We could use some help with organizing fun meetups.Looking forward to chatting with you!"
  },
  {
    "title": "SINGLES  ORGANIZATION",
    "Total Members": 2,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Thu, Apr 22, 2021",
    "Soonest Upcoming Event": "Sun, Apr 25",
    "description": "        This group is operated by The Human Potential Center (January 2, 2020)Hi there!You're invited to our tremendously varied Singles meetup group. JOIN US. (Click on the JOIN US button above.) It's FREE.Become one of the SINGLES ORGANIZATION's Singles (SO Single). Then attend an upcoming event you are interested in.You can also become an Assistant Organizer. We're always looking for new Assistant Organizers with new/fresh ideas. If you are willing to host events, please email me with your ideas. I would love to hear from you. Thanks!-----------------------------------------------------------------A VERY WARM WELCOME TO ALL SO Singles!Meet other singles while doing joyful and healthy things together: SOS events are focused around your interests - arts, music, photography, film, literature, books, sport events, museums, fitness, spiritual discourses, cultures and festivals.You could join us for beautiful nature hikes, or meditative walks in the park, or even attend a SO Single yoga and/or meditation workshop with other..."
  }
]
