[
  {
    "title": "WTF  (Wine, Travel, And Fun)",
    "url": "https://www.meetup.com/WTF-Wine-Travel-And-Fun/",
    "Total Members": 356,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Tue, Apr 27, 2021",
    "Days Since Most Recent Past Event": 1,
    "Days Until Soonest Upcoming Event": 5,
    "Soonest Upcoming Event": "Tue, May 4, 2021",
    "description": "We are all about fun. If you are single; this is for you. If you are in a committed relationship with a couch potato; this group is for you. If you are in a committed relationship and you both would like to hang out with a group of like-minded folks; this is for you. It is for anyone who enjoys game nights, wine festivals, beer tastings, hikes, weekend trips, and just about anything; this group is for you. If you enjoy drama and negativity, this group IS NOT for you."
  },
  {
    "title": "Over 50 Singles Group",
    "url": "https://www.meetup.com/meetup-group-cyEsGXGL/",
    "Total Members": 170,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Sat, Jun 6, 2020",
    "Days Since Most Recent Past Event": 326,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "People who are 50 and older and single...Happy and single. Wanting to find friendships, interacting and doing fun things with others your age???"
  },
  {
    "title": "Rainbow Women of SW Virginia",
    "url": "https://www.meetup.com/Rainbow-Women-of-SW-Virginia/",
    "Total Members": 28,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 4,
    "Most Recent Past Event": "Not Recent",
    "Days Since Most Recent Past Event": "Not Recent",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "Calling all Rainbow Women! Let's get together for hikes, brunch, festivals, book discussions, movies, community service, and much, much more. Membership in the group (and participation in all events) is for people who identify as women or gender non-conforming cis females, singles and couples. We'll meet at various locations around SW VA and many of our events are child- and pet-friendly. Let’s have fun while creating community!A few rules for our group:1. If your plans change and you have RSVP’d to an event, please change your RSVP within 24 hours of the event. This is to allow the event host enough time to change reservations, adjust plans, reorganize car pools, etc.2. In case of emergency, please do your best to change your RSVP, even if it is less than 24 hours until the event. You can also contact the event host directly and let her know that you cannot attend...."
  },
  {
    "title": "The Whisper in the Mountains",
    "url": "https://www.meetup.com/The-Whisper-in-the-Mountains/",
    "Total Members": 1,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": "Not Listed",
    "Most Recent Past Event": "Not Listed",
    "Days Since Most Recent Past Event": "Not Available",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "Single Christians to share a meal together reflex on scripture and ways to serve the Lord in our singleness. In doing so finding the Lord's presence in our sojourn journey to the Lord."
  }
]
