[
  {
    "title": "Austin Single Professionals Meetup Group",
    "url": "https://www.meetup.com/singleandpro/",
    "Total Members": 343,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Fri, Apr 30, 2021",
    "Days Since Most Recent Past Event": 1,
    "Days Until Soonest Upcoming Event": 5,
    "Soonest Upcoming Event": "Fri, May 7, 2021",
    "description": "How do you meet people in Austin? Join this group. If you are single in Austin and you are looking to meet other single people in Austin start here. We schedule events every month that will at the very least help you find more friends."
  },
  {
    "title": "Austin Singles Community",
    "url": "https://www.meetup.com/Austin-Singles-Community/",
    "Total Members": 1528,
    "Upcoming Events Displayed": 3,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sun, Apr 25, 2021",
    "Days Since Most Recent Past Event": 6,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Sun, May 2, 2021",
    "description": "A meetup for singles to explore the best Austin has to offer and what it means to be living in community in Austin, Texas. Popular events include dinners on Sunday evenings, hikes, dancing, movies, live music, football game parties, lake events and day trips.You can find us on Facebook. 'Like' this page to get notice of events, news for singles on your Facebook feed. https://tinyurl.com/austinsinglesCode of ConductBe kind and considerate to all. A real identity is needed. A recognizable picture of your face and/or your real name on your profile is required. Keep communications on the meetup positive, respectful of others, and nonpolitical.The Legal Stuff - Your Assumption of Risk, Release of LiabilityBy participating in an activity with Austin Singles Community, you are acknowledging the risk of injury while participating, and in exchange for the right to participate in the activity, you knowingly and voluntarily waive any and all rights,..."
  },
  {
    "title": "Active Awesome ATX 20s and 30s Singles Meetup",
    "url": "https://www.meetup.com/active-awesome-atx-20-s-30-s-singles-meetup/",
    "Total Members": 394,
    "Upcoming Events Displayed": 2,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sat, Apr 24, 2021",
    "Days Since Most Recent Past Event": 7,
    "Days Until Soonest Upcoming Event": 6,
    "Soonest Upcoming Event": "Sat, May 8, 2021",
    "description": "Let’s face it, dating apps are the worst. Sadly, being single isn’t a great alternative. Calling all 20s-30s single people! No matter what sexual orientation or gender identity. Let’s hang out in a group once a month to do some fun activities. During every event everyone will be given glow in dark wrist bands so that everyone can easily identify the group. Maybe make some friends, maybe meet someone special, maybe find a new favorite taco? Who knows! The sky is the limit!"
  },
  {
    "title": "Fun Singles 30s & 40s of Austin Texas",
    "url": "https://www.meetup.com/fun-singles-30s-and-40s/",
    "Total Members": 3875,
    "Upcoming Events Displayed": 1,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Sat, Mar 13, 2021",
    "Days Since Most Recent Past Event": 49,
    "Days Until Soonest Upcoming Event": 41,
    "Soonest Upcoming Event": "Sat, Jun 12, 2021",
    "description": "We're fun, single and in our 30/40s. We do a wide variety of meetups and activities in Austin. Just being social and meeting some other great people. We are all about being happy and having fun in any activity we take on. This group is meant to be a relaxing, no pressure, and fun way to meet other single folks of a similar age.Member Rules and Requirements:1. Yes - You need to be single in the traditional and legal sense. (No poly, open relationships, etc)2. Yes - We welcome those of all sexual orientations and gender identities. (Y'all means all!)3. Yes - You need to be in your 30s or 40s (actual physical age. sorry, young or old at heart doesn't apply.)4. Yes - You need to be fun! (No debbie downers please :)Please Note: This group is *not* tinder.It is not okay to message users without their permission that..."
  }
]
