[
  {
    "title": "North Austin Soccer",
    "url": "https://www.meetup.com/North-Austin-Soccer/",
    "Total Members": 4,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Fri, Apr 30, 2021",
    "Days Since Most Recent Past Event": 1,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Sat, May 1, 2021",
    "description": "ABOUT USWelcome to North Austin Soccer (NAS). We are the largest and most active organized co-ed soccer pick-up group in Austin with at least 4-5 games per week in North Central Austin and NW Austin/Cedar Park area. We welcome players of all ages above 18 yo and skill levels. If you're looking for fun, active people to play soccer with than you've come to the right place!Right now, NAS plays on a Summer and Winter schedule due to daylight hours and at several locations.SUMMER SCHEDULE (5-6x weekly), Mar - OctWINTER SCHEDULE (3-5x weekly), Nov -MarYEAR ROUND: We play year round as league teams (NAAFC - see Pages tab above) through Austin Mens Soccer Association (AMSA), Round Rock Soccer Assocation, Austin Coed Soccer Association (ACSA) and at Lakeline SoccerZone (Cedar Park).Any other suggestions for fields are welcomed - just PM me.The club is FREE to join.We use nice sized goals for..."
  },
  {
    "title": "South Austin Soccer",
    "url": "https://www.meetup.com/SouthAustinSoccer/",
    "Total Members": 3,
    "Upcoming Events Displayed": 4,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Fri, Apr 30, 2021",
    "Days Since Most Recent Past Event": 1,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Sat, May 1, 2021",
    "description": "This group is for all skill levels, whether you are in a league, haven't played in 10+ years, want to stay active and involved with the game, etc. We have a weekly scheduled pickup game at Zilker on Sunday mornings. On average, we have about 20 players come out per meetup even if there are less RSVPs. Members are also encouraged to network with each other to share other soccer events/ideas."
  },
  {
    "title": "Varsity Gay League: Austin Recreational Queer+ Sports League",
    "url": "https://www.meetup.com/Varsity-Gay-League-Austin-Gay-Rec-Sports-League/",
    "Total Members": 963,
    "Upcoming Events Displayed": 1,
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Thu, Apr 29, 2021",
    "Days Since Most Recent Past Event": 2,
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Sun, May 2, 2021",
    "description": "Varsity Gay League (VGL) is the nation’s original Queer+ recreational sports league, founded in 2007 and proudly representing over 20,000 LGBTQ+ & allied athletes across the US. Everyone is welcome, regardless of experience or identity. Our inclusive league offers a comprehensive list of social sports including Dodgeball, Kickball, Tennis, Soccer, Beach Volleyball, Bowling, Darts, and more to the Queer+ community, an umbrella term uniting the queer and allied communities for the love of sports. http://www.varsitygayleague.com/"
  },
  {
    "title": "Cricket and Soccer",
    "url": "https://www.meetup.com/Cricket-and-Soccer/",
    "Total Members": 50,
    "Upcoming Events Displayed": "Not Listed",
    "Past Events Displayed": 1,
    "Most Recent Past Event": "Not Recent",
    "Days Since Most Recent Past Event": "Not Recent",
    "Days Until Soonest Upcoming Event": "Not Available",
    "Soonest Upcoming Event": "Not Listed",
    "description": "The purpose of this group is to meet like-minded people who are interested in Cricket and/or Soccer. All skill levels and age groups are welcome."
  }
]
